# $Pandas$

- *fast*, *powerful*, *flexible* and easy to use **open source** **data** **analysis** and **manipulation** tool
- it has functions for **analyzing**, **cleaning**, **exploring**
- 
- 
- Data which is structured in a way
- 
- Pandas creates `Series` and `Dataframe` objects

- similarity in the way we learn `pandas` and `SQL`

trivia
- name pandas in Python comes from "**Panel Data**" 
- a term used in statistics and econometrics for data sets that include observations over multiple time periods for the same individuals 
- and also stands for "**Python Data Analysis**".
- S in the end to connotate nultiple datasets or `Series` objects

> ---

### Exercise

- Create dictionary name `data` of 5 `Students`
- Store `Math`, `English`, `Science` marks

In [9]:
data = {
    'Student': ,
    'Math': ,
    'English': ,
    'Science': ,
}

SyntaxError: expression expected after dictionary key and ':' (1496214719.py, line 2)

In [10]:
data = {
    'Student': ['Idrees','Saufi','Faiz','Dila','Nadirah'],
    'Math': [99, 85, 95, 85, 98],
    'English': [45, 35, 25, 65, 59],
    'Science': [55, 65, 75, 85, 87],
}

data

{'Student': ['Idrees', 'Saufi', 'Faiz', 'Dila', 'Nadirah'],
 'Math': [99, 85, 95, 85, 98],
 'English': [45, 35, 25, 65, 59],
 'Science': [55, 65, 75, 85, 87]}

In [104]:
# pip install pandas

import pandas as pd


# create a dataframe ---- Tables

df = pd.DataFrame(data)
print(df)
# dataframe appears as cool looking table in jupyter notebook

# index ---- column1 column2 ...

type(df)    # pandas.DataFrame

   Student  Math  English  Science
0   Idrees    99       45       55
1    Saufi    85       35       65
2     Faiz    95       25       75
3     Dila    85       65       85
4  Nadirah    98       59       87

pandas.DataFrame

In [12]:
# indexing ----- get the contents from an index
# df[0] # does not work here

# but it is working with columns
df['Student']       # works  #  pandas.Series ---- of Student column
df.Student   # works  #  pandas.Series ---- of Student column

0     Idrees
1      Saufi
2       Faiz
3       Dila
4    Nadirah
Name: Student, dtype: str

In [13]:
# series object ------ indexed sequences

srs = pd.Series(data)
srs

# index   ------ Content

# Series[index]

# srs[0] # does not work
srs['Student'] # Does work --- Contents of student
data['Student'] # Same thing, but we are using dictionary in this case!!!

['Idrees', 'Saufi', 'Faiz', 'Dila', 'Nadirah']

In [14]:
Math = [99, 85, 95, 85, 98]

# A proper series object
Math_srs = pd.Series(Math) # pandas.Series
Math_srs

# index --- actually is working like a charm
type(Math_srs) # exact result for us
type(Math_srs[2])

# Series --- saves on every index numpy data

numpy.int64

In [15]:
# df ---->  series
df.English # you can access each of the columns
df.Math
df.Student

0     Idrees
1      Saufi
2       Faiz
3       Dila
4    Nadirah
Name: Student, dtype: str


- $Series$ 
    - To store data at indexes
    - At each index, data was stored in a `numpy` `datatype` - or a `numpy` object inside


- $DataFrame$ 
    - Table
    - A combination of Series objects

### DataFrame Attributes / Properties
- .shape
- .dtypes
- .columns
- .size

In [36]:
df.dtypes

20

### Data types in dataframes in Pandas
- There are five main dtypes in pandas:

    - `object`: Text or mixed numeric values
    - `bool`: True or False values
    - `int64`: Integer values
    - `float64`: Floating point values
    - `datetime64`: Date and time values

In [17]:
# official documentation of pandas
# Create a sample DataFrame
df2 = pd.DataFrame({
   'float': [1.0],
   'int': [1],
   'datetime': [pd.Timestamp('20180310')],
   'string': ['foo']
})

# Check data types of all columns
print(df2.dtypes)

float              float64
int                  int64
datetime    datetime64[us]
string                 str
dtype: object

In [87]:
df3 = pd.DataFrame({'Weight': [45, 88, 56, 15, None],
                    'Weight': [45, 88, 56, 15, 25],
                   'Name': ['Sam', 'Andrea', 'Alex', 'James', 'Idrees'],
                   'Name2': ['Sam', 'Andrea', ['Alex'], True, 12],
                   'Age': [14, 25, 55, 8, 'accidentaly a string was put here']})

print(df3.dtypes)

Weight     int64
Name         str
Name2     object
Age       object
dtype: object

In [29]:
# Shape

df.shape # rows , columns ----- (5 rows, 4 columns)

pandas.Index

#### Index Objects
-

In [30]:
# Creating an Index with integers
index = pd.Index([1, 2, 3])
print(index) # Output: Index([1, 2, 3], dtype='int64')

# Creating an Index with strings
index = pd.Index(list('abc'))
print(index) # Output: Index(['a', 'b', 'c'], dtype='object')

Index([1, 2, 3], dtype='int64')
Index(['a', 'b', 'c'], dtype='str')

In [35]:
type(df.columns)
df.columns

Index(['Student', 'Math', 'English', 'Science'], dtype='str')

In [97]:
# access the names of all of the columns
for i, col in enumerate(df.columns):
    print(i, col)

# enumerate is used to index an iterable ---- something we can iterate over --- use for loops over

0 Student
1 Math
2 English
3 Science

In [98]:
df.size # number of elements in the dataframe

20

In [96]:
df.head() # first 5 entries of the dataframe
df.head(2)

  Student  Math  English  Science
0  Idrees    99       45       55
1   Saufi    85       35       65

In [45]:
df.tail() # last 5
df.tail(3)

   Student  Math  English  Science
2     Faiz    95       25       75
3     Dila    85       65       85
4  Nadirah    98       59       87

In [48]:
df.sample() # gives a random sample from data

df.sample(3)

   Student  Math  English  Science
0   Idrees    99       45       55
4  Nadirah    98       59       87
3     Dila    85       65       85

In [50]:
# to know the Statistics ---

df.describe()

# count values in each column
# mean of each column
# std deviation
# min , max, percentiles

            Math    English    Science
count   5.000000   5.000000   5.000000
mean   92.400000  45.800000  73.400000
std     6.913754  16.528763  13.520355
min    85.000000  25.000000  55.000000
25%    85.000000  35.000000  65.000000
50%    95.000000  45.000000  75.000000
75%    98.000000  59.000000  85.000000
max    99.000000  65.000000  87.000000

##### Methods useful for EDA - Exploratory Data Analysis
- .sort_values()
- .sort_index()
- .value_counts()
- .unique()
- .duplicated()
-

In [57]:
df
df_sortedby_english = df.sort_values(by='English', ascending=False)
df_sortedby_english

   Student  Math  English  Science
3     Dila    85       65       85
4  Nadirah    98       59       87
0   Idrees    99       45       55
1    Saufi    85       35       65
2     Faiz    95       25       75

In [60]:
df_sortedby_english.sort_index(ascending=True)

   Student  Math  English  Science
0   Idrees    99       45       55
1    Saufi    85       35       65
2     Faiz    95       25       75
3     Dila    85       65       85
4  Nadirah    98       59       87

In [63]:
# sorting just a column object ---- series object

df.English.sort_values()

df['English'].sort_values()
df['English'].sort_index()

0    45
1    35
2    25
3    65
4    59
Name: English, dtype: int64

In [67]:
df_birds = pd.DataFrame(
    {"num_legs": [2, 4, 4, 6], "num_wings": [2, 0, 0, 0]},
    index=["falcon", "dog", "cat", "ant"],
)

df_birds

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [71]:
# The value_counts() method in pandas is used to count the frequency of unique values in a DataFrame.
df.value_counts() # returns count of each value that appears in a column

df['Math'].value_counts()
df.Math.value_counts()

Math
85    2
99    1
95    1
98    1
Name: count, dtype: int64

In [77]:
# .unique() will return the unique values within a column ----- a series object --- not a data frame
df.English.unique()
df['Math'].unique()

array([99, 85, 95, 98])

In [82]:
# .duplicated() 
# run this on df ---- returns True for a duplicate row
# run this on series ---- returns True for a duplicate Value
df.duplicated()

df.English.duplicated()
df.Math.duplicated()

0    False
1    False
2    False
3     True
4    False
Name: Math, dtype: bool

In [85]:
# .drop_duplicated()

df.Math.duplicated()
unique_math = df.Math.drop_duplicates()
unique_math

0    99
1    85
2    95
4    98
Name: Math, dtype: int64